app/controllers/reviews_controller.rb

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = $1 LIMIT 1  [["id", "143"]]
---
	def new
		#@review = Review.new(:theater_id => params[:theater_id])
		#@theater_id = params[:theater_id]
		theater = Theater.find(params[:theater_id])

INSERT INTO "reviews" ("created_at", "rating", "review_text", "theater_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 15 Jul 2014 23:56:30 UTC +00:00], ["rating", 4], ["review_text", "1dasfsagddsf"], ["theater_id", 143], ["updated_at", Tue, 15 Jul 2014 23:56:30 UTC +00:00], ["user_id", 1]]
---
	def create
	  #@theater = Theater.find params[:theater_id]
	  #@user_id = current_user
	  #@review = Review.create(review_params.merge(:user_id => @user_id, :theater_id => @theater_id))
	  #@review.theater = @theater

	  theater = Theater.find(params[:theater_id])
    	#2nd you create the comment with arguments in params[:comment]
      @review = theater.reviews.create(review_params)