app/controllers/theaters_controller.rb

SELECT "theaters".* FROM "theaters" WHERE (zipcode = '11216')
---
	def create
		@zip = params[:zip]
		get_theaters(@zip)
		@theaters = Theater.where("zipcode = ?", @zip)

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = $1 LIMIT 1  [["id", "45"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."theater_id" = 62
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
	def show
		@theater = Theater.find(params[:id])
		@reviews = Review.where(:theater_id => params[:id])
		@user = User.find(1)